bit-finance/Reports/бит_ПланФактныйАнализБюджетаСРасчетами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>бит_ПланФактныйАнализБюджетаСРасчетами</Name>
		</Properties>
	</Report>
</MetaDataObject>

bit-finance/Enums/бит_ПериодичностьПланирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ПериодичностьПланирования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
					<Comment>(БИТ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
					<Comment>(БИТ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декада</Name>
					<Comment>(БИТ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
					<Comment>(БИТ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
					<Comment>(БИТ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полугодие</Name>
					<Comment>(БИТ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
					<Comment>(БИТ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

bit-finance/Reports/бит_ПланФактныйАнализБюджетаСРасчетами/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// Задает расширенные настройки отчета.
//
// Параметры:
//   Настройки - Коллекция - настройки отчетов и вариантов отчетов конфигурации.
//   ОписаниеОтчета - СтрокаДерева
//                  - ОбъектМетаданных - описание настроек, метаданные или ссылка отчета.
//
Процедура НастроитьВариантыОтчета(Настройки, ОписаниеОтчета) Экспорт
	
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ПланФактныйАнализБюджетаСРасчетами");
	ОписаниеВарианта.Описание = НСтр("ru = 'Позволяет выполнить сравнительный анализ данных по сценариям бюджетирования с расчетами.'
									 |en = 'Allows you to perform a comparative analysis of data on budgeting scenarios with calculations'");

	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ИзвлечьСхемуИзДвоичныхДанных(ЗагруженнаяСхема) Экспорт
	
	ПолноеИмяФайла = ПолучитьИмяВременногоФайла();
	ЗагруженнаяСхема.Записать(ПолноеИмяФайла);
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(ПолноеИмяФайла);
	
	СхемаКД = СериализаторXDTO.ПрочитатьXML(ЧтениеXML, Тип("СхемаКомпоновкиДанных"));
	
	ЧтениеXML.Закрыть();
	ЧтениеXML = Неопределено;
	
	УдалитьФайлы(ПолноеИмяФайла);
	
	Если СхемаКД.НастройкиПоУмолчанию.ДополнительныеСвойства.Свойство("СхемаКомпоновкиДанных") Тогда
		СхемаКД.НастройкиПоУмолчанию.ДополнительныеСвойства.СхемаКомпоновкиДанных = Неопределено;
	КонецЕсли;
	
	Возврат СхемаКД;
	
КонецФункции

Функция ЗагрузитьНастройкиПриИзмененииПараметров() Экспорт 
	
	Параметры = Новый Массив;
	Параметры.Добавить(Новый ПараметрКомпоновкиДанных("ПоБюджету"));
	Параметры.Добавить(Новый ПараметрКомпоновкиДанных("ВариантИсполнения"));
	
	Возврат Параметры;
	
КонецФункции

Функция ФиксированныеПараметры(Настройки, ПользовательскиеНастройки, ДоступныеЗначения) Экспорт 
	
	// Значения параметров по умолчанию.
	ФиксированныеПараметры = НовыеФиксированныеПараметры();
	
	ДоступныеЗначения = Новый Структура("Периодичность"); 
	
	Идентификаторы = ОбщегоНазначенияКлиентСервер.КлючиСтруктурыВСтроку(ФиксированныеПараметры, ",");
	Идентификаторы = СтрРазделить(Идентификаторы, ", ", Ложь);
	Для каждого Идентификатор Из Идентификаторы Цикл
		Если Идентификатор = "Периодичность" Тогда
			ДоступныеЗначения.Периодичность = ДоступныеЗначенияПериодичности(ФиксированныеПараметры.ВариантИсполнения);
			УстановитьФиксированныйПараметр(Идентификатор, ФиксированныеПараметры, Настройки, 
				ПользовательскиеНастройки, ДоступныеЗначения.Периодичность);
		Иначе	
			УстановитьФиксированныйПараметр(Идентификатор, ФиксированныеПараметры, Настройки, ПользовательскиеНастройки);
		КонецЕсли;
	КонецЦикла; 
			
	Идентификаторы  = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("ПоБюджету, ВариантИсполнения");
	ПараметрыДанных = Настройки.ПараметрыДанных.Элементы;
	Для Каждого Идентификатор Из Идентификаторы Цикл 
		ЭлементНастройки = ПараметрыДанных.Найти(Идентификатор);
		Если ЭлементНастройки = Неопределено
			Или ЭлементНастройки.Значение = ФиксированныеПараметры[Идентификатор] Тогда 
			Продолжить;
		КонецЕсли;
		
		Настройки.ДополнительныеСвойства.Вставить("ОтчетИнициализирован", Ложь);
		Прервать;
	КонецЦикла;
	
	Возврат ФиксированныеПараметры;
КонецФункции

// Устанавливает значения специализированных параметров универсального отчета.
//
// Параметры:
//  Отчет - 
//  ФиксированныеПараметры - см. ФиксированныеПараметры
//  Настройки - НастройкиКомпоновкиДанных - 
//  ПользовательскиеНастройки - ПользовательскиеНастройкиКомпоновкиДанных - 
//
Процедура УстановитьФиксированныеПараметры(Отчет, ФиксированныеПараметры, Настройки, ПользовательскиеНастройки) Экспорт 
	ПараметрыДанных = Настройки.ПараметрыДанных;
	
	ДоступныеПараметры = ПараметрыДанных.ДоступныеПараметры;
	Если ДоступныеПараметры = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Для Каждого Параметр Из ФиксированныеПараметры Цикл 
		Если ДоступныеПараметры.Элементы.Найти(Параметр.Ключ) = Неопределено Тогда 
			Продолжить;
		КонецЕсли;
		
		ЭлементНастройки = ПараметрыДанных.Элементы.Найти(Параметр.Ключ);
		Если ЭлементНастройки = Неопределено Тогда 
			ЭлементНастройки = ПараметрыДанных.Элементы.Добавить();
			ЭлементНастройки.Параметр = Новый ПараметрКомпоновкиДанных(Параметр.Ключ);
			ЭлементНастройки.Значение = Параметр.Значение;
			ЭлементНастройки.Использование = Истина;
		Иначе
			ПараметрыДанных.УстановитьЗначениеПараметра(Параметр.Ключ, Параметр.Значение);
		КонецЕсли;
		
		ЭлементПользовательскойНастройки = Неопределено;
		Если ПользовательскиеНастройки <> Неопределено Тогда 
			ЭлементПользовательскойНастройки = ПользовательскиеНастройки.Элементы.Найти(
				ЭлементНастройки.ИдентификаторПользовательскойНастройки);
		КонецЕсли;
		
		Если ЭлементПользовательскойНастройки <> Неопределено Тогда 
			ЗаполнитьЗначенияСвойств(ЭлементПользовательскойНастройки, ЭлементНастройки, "Использование, Значение");
		КонецЕсли;
	КонецЦикла;
	
	Если ПользовательскиеНастройки <> Неопределено Тогда 
		ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("ОтчетИнициализирован", Истина);
	КонецЕсли;
КонецПроцедуры

Процедура УстановитьСтандартныеНастройкиЗагруженнойСхемы(Отчет, ДвоичныеДанныеСхемы, Настройки, ПользовательскиеНастройки) Экспорт 
	Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Настройки.ДополнительныеСвойства, "ОтчетИнициализирован", Ложь) Тогда 
		Возврат;
	КонецЕсли;
	
	Настройки = Отчет.СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	Настройки.ДополнительныеСвойства.Вставить("СхемаКомпоновкиДанных", ДвоичныеДанныеСхемы);
	Настройки.ДополнительныеСвойства.Вставить("ОтчетИнициализирован",  Истина);
КонецПроцедуры

// Устанавливает настройки по умолчанию.
//
// Параметры:
//  Отчет - ОтчетОбъект - 
//  ФиксированныеПараметры - см. ФиксированныеПараметры
//  Настройки - НастройкиКомпоновкиДанных - 
//  ПользовательскиеНастройки - ПользовательскиеНастройкиКомпоновкиДанных - 
//
Процедура УстановитьСтандартныеНастройки(Отчет, ФиксированныеПараметры, Настройки, ПользовательскиеНастройки) Экспорт 
	
	ОтчетИнициализирован = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		Настройки.ДополнительныеСвойства, "ОтчетИнициализирован", Ложь);
	
	Если ОтчетИнициализирован Тогда 
		Возврат;
	КонецЕсли;
	
	Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(Отчет.СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	
	Настройки = Отчет.КомпоновщикНастроек.Настройки;
	бит_ОтчетыБФКлиентСервер.УдалитьОтбор(Настройки.Отбор, "Статья");
		
	УстановитьФиксированныеПараметры(Отчет, ФиксированныеПараметры, Настройки, ПользовательскиеНастройки);
	
	Настройки.ДополнительныеСвойства.Вставить("ОтчетИнициализирован", Истина);
	
КонецПроцедуры

Функция СхемаКомпоновкиДанных(ФиксированныеПараметры) Экспорт 
	
	СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	ПолеСтатья = СхемаКомпоновкиДанных.НаборыДанных.СписокСтатей.Поля.Найти("Статья");
	Для каждого Элемент Из ПолеСтатья.ПараметрыРедактирования.Элементы Цикл
		Если ТипЗнч(Элемент.Значение) = Тип("СвязиПараметровВыбораКомпоновкиДанных") Тогда
			Элемент.Значение.Очистить();
			Если ФиксированныеПараметры.ПоБюджету Тогда
				НоваяСвязь = Элемент.Значение.Добавить();
				НоваяСвязь.Имя  = "Отбор.Владелец";
				НоваяСвязь.Поле = Новый ПолеКомпоновкиДанных("ПараметрыДанных.Бюджет");
				Элемент.Использование = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла; 
	
	Если ФиксированныеПараметры.ПоБюджету Тогда
		ИспользованиеПараметраБюджет = ИспользованиеПараметраКомпоновкиДанных.Всегда;
	Иначе	
		ИспользованиеПараметраБюджет = ИспользованиеПараметраКомпоновкиДанных.Авто;
	КонецЕсли;
	СхемаКомпоновкиДанных.Параметры.Бюджет.ЗапрещатьНезаполненныеЗначения = ФиксированныеПараметры.ПоБюджету;
	СхемаКомпоновкиДанных.Параметры.Бюджет.Использование 				  = ИспользованиеПараметраБюджет;
	СхемаКомпоновкиДанных.Параметры.Бюджет.ОграничениеИспользования		  = НЕ ФиксированныеПараметры.ПоБюджету;
	
	СхемаКомпоновкиДанных.Параметры.Период.ОграничениеИспользования		  = ФиксированныеПараметры.ВариантИсполнения > 1;
	
	ДоступныеЗначения = ДоступныеЗначенияПериодичности(ФиксированныеПараметры.ВариантИсполнения);
	СхемаКомпоновкиДанных.Параметры.Периодичность.УстановитьДоступныеЗначения(ДоступныеЗначения);
	
	Для каждого Элемент Из Перечисления.бит_ПериодичностьПланирования Цикл
		Если ДоступныеЗначения.НайтиПоЗначению(Элемент) = Неопределено Тогда
			ИмяЗначения = ОбщегоНазначения.ИмяЗначенияПеречисления(Элемент);
			Поле = СтрШаблон("Период%1", ИмяЗначения);
			ПолеНабора = СхемаКомпоновкиДанных.НаборыДанных.Результат.Поля.Найти(Поле);
			Если ПолеНабора <> Неопределено Тогда
				ПолеНабора.ОграничениеИспользования.Группировка = Истина;
				ПолеНабора.ОграничениеИспользования.Поле 		= Истина;
				ПолеНабора.ОграничениеИспользования.Порядок 	= Истина;
				ПолеНабора.ОграничениеИспользования.Условие 	= Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла; 
	
	УстановитьЗаголовкиПолейДопИзмерений(СхемаКомпоновкиДанных);
	
	Возврат СхемаКомпоновкиДанных;
	
КонецФункции

Функция ПодготовитьСхемуПоСпискуСценариев(СхемаКомпоновкиДанных, СценарииДляСравнения, ПользовательскиеПараметры) Экспорт

	Если НЕ ЗначениеЗаполнено(СценарииДляСравнения) Тогда
		Возврат СхемаКомпоновкиДанных;
	КонецЕсли;
	
	НоваяСхема 		   = бит_ОтчетыБФСервер.СкопироватьСхемуКомпоновкиДанных(СхемаКомпоновкиДанных);
	ТекстЗапросаЭталон = СхемаКомпоновкиДанных.НаборыДанных.Результат.Элементы.НаборДанных1.Запрос;
	
	Для Номер = 2 По СценарииДляСравнения.Количество() Цикл
		бит_ОтчетыБФСервер.СкопироватьНаборыДанных(НоваяСхема.НаборыДанных.Результат,
				СхемаКомпоновкиДанных.НаборыДанных.Результат, СтрШаблон("НаборДанных%1", Номер));
	КонецЦикла; 
			
	Для Номер = 1 По СценарииДляСравнения.Количество() Цикл
		ИмяНабораДанных = СтрШаблон("НаборДанных%1", Номер);
		ТекстЗапроса 	= ТекстЗапросаРезультат(ТекстЗапросаЭталон, Номер, ПользовательскиеПараметры);
		НоваяСхема.НаборыДанных.Результат.Элементы[ИмяНабораДанных].Запрос = ТекстЗапроса;		
	КонецЦикла; 
	
	Возврат НоваяСхема;
	
КонецФункции
 
Процедура УстановитьЗаголовкиПолейДопИзмерений(СхемаКомпоновкиДанных) Экспорт
	
	бит_МеханизмДопИзмерений.НастроитьПоляДополнительныхИзмеренийВСКД(СхемаКомпоновкиДанных, "Результат");
	
КонецПроцедуры

// АПК:299-выкл

// Вычисляет значение "динамического периода" для варианта "по аналогичным периодам".
// Вызывается в параметре расшифровки макета поля "Сумма N" отчета.
//
// Параметры:
//  Дата				 - Дата - значение динамического перида.
//  Период				 - СтандартныйПериод - параметр "Период N" отчета. 
//  Периодичность		 - ПеречислениеСсылка.бит_ПериодичностьПланирования	 - периодичность отчета.
//  ВариантИсполнения	 - Число - Вариант исполнения отчета.
// 
// Возвращаемое значение:
//  Дата - динамический период. 
//
Функция ДинамическийПериодВРасшифровке(Дата, Период, Периодичность, ВариантИсполнения) Экспорт

	Если НЕ ЗначениеЗаполнено(Дата) Тогда
		Дата = Дата('00010101');	
	КонецЕсли;		
	
	ДинамическийПериод = Дата;
	Если ВариантИсполнения > 1 Тогда
		НачалоГода  = НачалоГода(Период.ДатаНачала); 
		НомерМесяца = Месяц(Дата);
		ДинамическийПериод = ДобавитьМесяц(НачалоГода, НомерМесяца - 1);
	КонецЕсли;
	
	Возврат ДинамическийПериод;

КонецФункции

// Формирует список сценариев для расшифровки.
// Вызывается в параметре расшифровки макета поля "Сумма N" отчета.
//
// Параметры:
//  Сценарий1 - СправочникСсылка.СценарииПланирования.
//  Сценарий2 - СправочникСсылка.СценарииПланирования. 
//
// Возвращаемое значение:
//  СписокЗначений - список сценариев. 
//
Функция СравниваемыеСценарииВРасшифровке(Сценарий1, Сценарий2) Экспорт 

	Список = Новый СписокЗначений; 
	Список.Добавить(Сценарий1);
	Список.Добавить(Сценарий2);

	Возврат Список;
	
КонецФункции

// АПК:299-вкл

Функция НовыйСписок() Экспорт 

	Список = Новый ТаблицаЗначений; 
	Список.Колонки.Добавить("Эталон", 		  Новый ОписаниеТипов("Булево"));
	Список.Колонки.Добавить("Сценарий",		  Новый ОписаниеТипов("СправочникСсылка.СценарииПланирования"));
	Список.Колонки.Добавить("Код", 			  ОбщегоНазначения.ОписаниеТипаСтрока(25));
	Список.Колонки.Добавить("Период", 		  Новый ОписаниеТипов("СтандартныйПериод"));
	Список.Колонки.Добавить("НомерСтроки", ОбщегоНазначения.ОписаниеТипаЧисло(1));
	
	Возврат Список;
	
КонецФункции

Функция НовыеФиксированныеПараметры() Экспорт

	ХранилищеСценарииДляСравнения = Новый ХранилищеЗначения(НовыйСписок(), Новый СжатиеДанных(9));
	
	ФиксированныеПараметры = Новый Структура;
	ФиксированныеПараметры.Вставить("ВариантИсполнения", 	1); // ВАЖНО. Должен определяться. Влияет на настройки.
	ФиксированныеПараметры.Вставить("Период", 				Новый СтандартныйПериод);
	ФиксированныеПараметры.Вставить("ПоБюджету", 			Ложь);
	ФиксированныеПараметры.Вставить("Бюджет", 				Справочники.бит_Бюджеты.ПустаяСсылка());
	ФиксированныеПараметры.Вставить("Периодичность", 		Перечисления.бит_ПериодичностьПланирования.Месяц);
	ФиксированныеПараметры.Вставить("Показатели", 			1);
	ФиксированныеПараметры.Вставить("ВыводитьКоличество", 	Ложь);
	ФиксированныеПараметры.Вставить("СценарииДляСравнения", ХранилищеСценарииДляСравнения);
	
	Возврат ФиксированныеПараметры;

КонецФункции

Процедура УправлениеФормой(Форма) Экспорт

	Настройки = Форма.Отчет.КомпоновщикНастроек.ПользовательскиеНастройки;
	Параметр = бит_ОтчетыБФКлиентСервер.ПолучитьПараметр(Настройки,"ВариантИсполнения");
	ВариантИсполнения = 1;
	Если Параметр <> Неопределено Тогда
		ВариантИсполнения = Параметр.Значение;	
	КонецЕсли;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, 
		"СценарииДляСравненияПериод", "Видимость", ВариантИсполнения > 1);

КонецПроцедуры
 
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаРезультат(ТекстЗапроса, НомерЗапроса, ПользовательскиеПараметры)

	ВариантыСуммы   = ПользовательскиеПараметры.Показатели;
	ШаблонПоляСумма = "ТаблицаОборотыИсточник.%1Оборот КАК Сумма%%1";
	ПолеСуммы       = "Сумма";
	Если ВариантыСуммы = 1 Тогда
		ПолеСуммы = "СуммаУпр";
	ИначеЕсли ВариантыСуммы = 2 Тогда
		ПолеСуммы = "СуммаРегл";
	ИначеЕсли ВариантыСуммы = 3 Тогда
		ПолеСуммы = "СуммаСценарий";
	КонецЕсли;
	ШаблонПоляСумма  = СтрШаблон(ШаблонПоляСумма, ПолеСуммы);
	ОбразецПоляСумма = "(0) КАК Сумма%1";
	
	ШаблонПоляКоличество  = "ТаблицаОборотыИсточник.КоличествоОборот КАК Количество%1";
	ОбразецПоляКоличество = "(0) КАК Количество%1";
	
	ШаблонНачалоПерода  = "&НачалоПериода%1";
	ОбразецНачалоПерода = "&НачалоПериода1";
	
	ШаблонКонецПериода  = "&КонецПериода%1";
	ОбразецКонецПериода = "&КонецПериода1";
	
	ШаблонСценарий	= "&Сценарий%1";
	ОбразецСценарий = "&Сценарий1";
	
	ПараметрыЗамены = Новый Соответствие; 
	ПараметрыЗамены.Вставить(ОбразецПоляСумма, ШаблонПоляСумма);
	ПараметрыЗамены.Вставить(ОбразецПоляКоличество, ШаблонПоляКоличество);
	ПараметрыЗамены.Вставить(ОбразецНачалоПерода, ШаблонНачалоПерода);
	ПараметрыЗамены.Вставить(ОбразецКонецПериода, ШаблонКонецПериода);
	ПараметрыЗамены.Вставить(ОбразецСценарий, ШаблонСценарий);
	
	НовыйТекстЗапроса = ТекстЗапроса;
	Для каждого КлючЗначение Из ПараметрыЗамены Цикл
		Если СтрНайти(КлючЗначение.Ключ, "%") = 0 Тогда
			ЧтоЗаменить   = КлючЗначение.Ключ;
			НаЧтоЗаменить = СтрШаблон(КлючЗначение.Значение, НомерЗапроса);
		Иначе	
			ЧтоЗаменить   = СтрШаблон(КлючЗначение.Ключ, НомерЗапроса);
			НаЧтоЗаменить = СтрШаблон(КлючЗначение.Значение, НомерЗапроса);
		КонецЕсли;
		НовыйТекстЗапроса = СтрЗаменить(НовыйТекстЗапроса, ЧтоЗаменить, НаЧтоЗаменить);
	КонецЦикла;
	
	ТекстУсловияВывода = ТекстУсловияВыводаЗначений(ПользовательскиеПараметры);
	НовыйТекстЗапроса  = СтрЗаменить(НовыйТекстЗапроса, "&ПереопределяемаяФормулаУсловияВывода", ТекстУсловияВывода);
	
	Возврат НовыйТекстЗапроса;
	
КонецФункции

Функция ТекстУсловияВыводаЗначений(ПользовательскиеПараметры)
	
	Если ПользовательскиеПараметры.ОтображатьПустыеСтроки Тогда
		Возврат "ИСТИНА";
	КонецЕсли;
	
	ПоляПроверкиВывода    = Новый Массив;
	Если ПользовательскиеПараметры.ВыводитьСумму Тогда
		ДобавитьПутьКПолюПроверкиВывода(ПоляПроверкиВывода, "Сумма");
	КонецЕсли;
	Если ПользовательскиеПараметры.ВыводитьКоличество Тогда
		ДобавитьПутьКПолюПроверкиВывода(ПоляПроверкиВывода, "Количество");
	КонецЕсли;
	
	ТекстУсловияВывода = СтрСоединить(ПоляПроверкиВывода, Символы.ПС + Символы.Таб + "ИЛИ ");
	ТекстУсловияВывода = "(" + ТекстУсловияВывода + ")";
	Возврат ТекстУсловияВывода;
	
КонецФункции

Процедура ДобавитьПутьКПолюПроверкиВывода(ПоляПроверкиВывода, ИмяПоля)
	
	ШаблонПоляПроверки    = "ОборотыПоБюджетам.%1%2 <> 0";
	КоличествоПоказателей = 5;
	Для НомерПоказателя = 1 По КоличествоПоказателей Цикл
		ПолеПроверки = СтрШаблон(ШаблонПоляПроверки, ИмяПоля, НомерПоказателя);
		ПоляПроверкиВывода.Добавить(ПолеПроверки);
	КонецЦикла;
	
КонецПроцедуры
 
Функция ДоступныеЗначенияПериодичности(ВариантИсполнения)
	
	ДоступныеЗначения = Новый СписокЗначений; 
	
	Если ВариантИсполнения > 1 Тогда
		ДоступныеЗначения.Добавить(Перечисления.бит_ПериодичностьПланирования.Месяц);
		ДоступныеЗначения.Добавить(Перечисления.бит_ПериодичностьПланирования.Квартал);
		ДоступныеЗначения.Добавить(Перечисления.бит_ПериодичностьПланирования.Полугодие);
		ДоступныеЗначения.Добавить(Перечисления.бит_ПериодичностьПланирования.Год);
	Иначе
		ДоступныеЗначения.Добавить(Перечисления.бит_ПериодичностьПланирования.День);
		ДоступныеЗначения.Добавить(Перечисления.бит_ПериодичностьПланирования.Неделя);
		ДоступныеЗначения.Добавить(Перечисления.бит_ПериодичностьПланирования.Декада);
		ДоступныеЗначения.Добавить(Перечисления.бит_ПериодичностьПланирования.Месяц);
		ДоступныеЗначения.Добавить(Перечисления.бит_ПериодичностьПланирования.Квартал);
		ДоступныеЗначения.Добавить(Перечисления.бит_ПериодичностьПланирования.Полугодие);
		ДоступныеЗначения.Добавить(Перечисления.бит_ПериодичностьПланирования.Год);
	КонецЕсли;
	
	Возврат ДоступныеЗначения;

КонецФункции

Процедура УстановитьФиксированныйПараметр(Идентификатор, Параметры, Настройки, ПользовательскиеНастройки, ДоступныеЗначения = Неопределено)
	
	ФиксированныйПараметр = Параметры[Идентификатор];
	
	Если ДоступныеЗначения = Неопределено Тогда 
		ДоступныеЗначения = Новый СписокЗначений;
	КонецЕсли;
	
	ЭлементНастройки = Настройки.ПараметрыДанных.Элементы.Найти(Идентификатор);
	Если ЭлементНастройки = Неопределено Тогда 
		Если ДоступныеЗначения.Количество() > 0 Тогда 
			Параметры[Идентификатор] = ДоступныеЗначения[0].Значение;
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	ЭлементПользовательскойНастройки = Неопределено;
	Если ТипЗнч(ПользовательскиеНастройки) = Тип("ПользовательскиеНастройкиКомпоновкиДанных")
		И (Настройки.ДополнительныеСвойства.Свойство("ОтчетИнициализирован")
		Или ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("ОтчетИнициализирован")) Тогда 
		
		ЭлементПользовательскойНастройки = ПользовательскиеНастройки.Элементы.Найти(
			ЭлементНастройки.ИдентификаторПользовательскойНастройки);
	КонецЕсли;
	
	Если ЭлементПользовательскойНастройки <> Неопределено
		И ДоступныеЗначения.НайтиПоЗначению(ЭлементПользовательскойНастройки.Значение) <> Неопределено Тогда 
		ФиксированныйПараметр = ЭлементПользовательскойНастройки.Значение;
	ИначеЕсли ДоступныеЗначения.НайтиПоЗначению(ЭлементНастройки.Значение) <> Неопределено Тогда 
		ФиксированныйПараметр = ЭлементНастройки.Значение;
	ИначеЕсли ДоступныеЗначения.Количество() > 0 Тогда 
		ФиксированныйПараметр = ДоступныеЗначения[0].Значение;
	ИначеЕсли ЭлементПользовательскойНастройки <> Неопределено
		И ЗначениеЗаполнено(ЭлементПользовательскойНастройки.Значение) Тогда 
		ФиксированныйПараметр = ЭлементПользовательскойНастройки.Значение;
	ИначеЕсли ЗначениеЗаполнено(ЭлементНастройки.Значение) Тогда 
		ФиксированныйПараметр = ЭлементНастройки.Значение;
	КонецЕсли;
	
	Параметры[Идентификатор] = ФиксированныйПараметр;
	
КонецПроцедуры

// Возвращает имена рассчетных ресурсов отчета.
//
// Возвращаемое значение:
//  Массив.
//
Функция РесурсыОтчета()
	
	РесурсыОтчета = Новый Массив;
	РесурсыОтчета.Добавить("Количество1");
	РесурсыОтчета.Добавить("Количество2");
	РесурсыОтчета.Добавить("Количество3");
	РесурсыОтчета.Добавить("Количество4");
	РесурсыОтчета.Добавить("Количество5");
	РесурсыОтчета.Добавить("Сумма1");
	РесурсыОтчета.Добавить("Сумма2");
	РесурсыОтчета.Добавить("Сумма3");
	РесурсыОтчета.Добавить("Сумма4");
	РесурсыОтчета.Добавить("Сумма5");
	
	Возврат РесурсыОтчета;
	
КонецФункции

#КонецОбласти 

#КонецЕсли
